{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Equivalent Master in France",
      "department": "Data Sciences",
      "duration": "2021",
      "school_name": "Paris-Sorbonne university"
    },
    {
      "awards_achievements": null,
      "degree": "Bsc Sciences of Engineering",
      "department": "Electrical Engineering",
      "duration": "2017-2018",
      "school_name": "Paris Diderot school"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_TerenceBeaujour",
  "highlighted_projects": [
    {
      "description": "Implemented a complete machine/deep learning unit for the Nouméa hospital in New-Caledonia. This tool allows the hospital to answer different problems, Prediction of patient admission (classification), prediction of length of stay in the emergency department (regression) and prediction of patient flow the next day (Recurrent Neural Network).",
      "git_url": "https://github.com/terencebeauj/mle_project",
      "name": "Machine Learning"
    },
    {
      "description": "Realization of an arbitrage algorithm for crypto currencies. Real time data retrieval with websockets on the Binance exchange, scanning of 1000 different triangles in real time, placing limit orders using multi-threading.",
      "git_url": null,
      "name": "Algorithmic Trading"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a software that retrieves and stores hardware information and resources usage for a Linux cluster of 10 nodes running on CentOS 7. Bash scripts were generated to store the data in a PostgreSQL database that was run by a docker container.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: In progress",
        "JDBC App: Not started.",
        "Grep App: Not started."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_analytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Terence Beaujour",
  "others": [
    {
      "bullets": [
        "Trading (manual and algorithmic)",
        "Video game player",
        "Piano learner"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked on a complete project using Linux, SQL and docker, to help Jarvis team to monitor their cluster. Used Agile method to collaborate with other team members and to manage the project.",
      "duration": "2022-present",
      "title": "Software Engineer"
    },
    {
      "company": "Vezgo",
      "description": "Optimized and implemented different connectors to connect and retrieve data from different exchanges and blockchain. Used NodeJS to implement the software, connected to MongoDB database to store and manage the data. Used git and github to manage the software and Agile method to manage the project.",
      "duration": "2021-2022",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "NodeJS",
      "RDBMS/SQL",
      "Java",
      "Deep Learning",
      "TensorFlow",
      "PyTorch",
      "MQL5",
      "Linux/Bash",
      "NoSQL"
    ],
    "familiar": [
      "C++",
      "HTML",
      "CSS",
      "TypeScript",
      "React",
      "Kubernetes",
      "AWS"
    ],
    "proficient": [
      "Python",
      "Machine Learning",
      "Scikit Learn",
      "Data analysis",
      "Agile/Scrum",
      "Git",
      "Docker",
      "API"
    ]
  },
  "summary": "I graduated from Paris Diderot school with a Bsc in Science of Engineering, and I also have the equivalent of a Master in Data Science and Machine Learning Engineering that I got with Paris Sorbonne University and DataScientest. I started my career as a freelancer in algorithmic trading, and I used the MQL5 language to develop several bots for the MT5 platform. I have also worked on an arbitrage bot for the Binance exchange, using the Python language, with advanced concepts like asynchronous programming and multi threading. I have also worked one year as a software developer at Vezgo, a company specialized in crypto currency and DeFi, where my job was to implement and optimize several connector with NodeJS that connect to exchanges and blockchains in order to retrieve financial data and store them in a MongoDB database. We were using Agile methodology and beyond acquiring more advanced programming skills, I also learned how to manage a project, I improved my communication skills and I learned to work in a team. I am passionate by data science and data engineering and my goal is to join a great team of engineers so I can bring my skills and competences and I can learn as much as I can from them."
}
